Clash Bot Workflow - plan
#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Workflow Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

#### Prerequisites
```

terraform
module.create_team_step_function.data.aws_region.current[0]: Reading...
data.aws_acm_certificate.issued: Reading...
module.create_team_step_function.data.aws_caller_identity.current: Reading...
aws_iam_role.lambda_publisher_exec: Refreshing state... [id=clash_bot_lambda_event_publisher_exec_role]
module.create_team_step_function.data.aws_region.current[0]: Read complete after 0s [id=us-east-1]
aws_iam_role.lambda_handler_exec: Refreshing state... [id=clash_bot_lambda_event_handler_exec_role]
module.api_gateway.aws_apigatewayv2_api.this[0]: Refreshing state... [id=w6261upn4d]
module.clash_bot_event_sqs.aws_sqs_queue.this[0]: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/816923827429/clash-bot-event-sqs-development.fifo]
module.dynamodb_table.aws_dynamodb_table.this[0]: Refreshing state... [id=clash-bot-workflow-development]
module.create_team_step_function.data.aws_iam_policy_document.assume_role[0]: Reading...
module.create_team_step_function.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=4239894905]
module.create_team_step_function.aws_iam_role.this[0]: Refreshing state... [id=retrieve-teams-development]
module.create_team_step_function.data.aws_caller_identity.current: Read complete after 0s [id=816923827429]
aws_iam_role_policy_attachment.lambda_handler_exec_policy: Refreshing state... [id=clash_bot_lambda_event_handler_exec_role-20231113024937325800000001]
aws_iam_role_policy_attachment.lambda_publisher_exec_policy: Refreshing state... [id=clash_bot_lambda_event_publisher_exec_role-20231113024937336300000002]
module.create_team_step_function.data.aws_iam_policy_document.service["dynamodb"]: Reading...
module.create_team_step_function.data.aws_iam_policy_document.service["dynamodb"]: Read complete after 0s [id=3233016293]
module.create_team_step_function.aws_sfn_state_machine.this[0]: Refreshing state... [id=arn:aws:states:us-east-1:816923827429:stateMachine:retrieve-teams-development]
module.create_team_step_function.aws_iam_policy.service["dynamodb"]: Refreshing state... [id=arn:aws:iam::816923827429:policy/retrieve-teams-development-dynamodb]
module.create_team_step_function.aws_iam_policy_attachment.service["dynamodb"]: Refreshing state... [id=retrieve-teams-development-dynamodb]
data.aws_acm_certificate.issued: Read complete after 0s [id=arn:aws:acm:us-east-1:816923827429:certificate/1d277044-1781-46f9-b693-50c8ff95546a]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_lambda_event_source_mapping.sqs_trigger will be created
  + resource "aws_lambda_event_source_mapping" "sqs_trigger" {
      + batch_size                    = 1
      + enabled                       = true
      + event_source_arn              = "arn:aws:sqs:us-east-1:816923827429:clash-bot-event-sqs-development.fifo"
      + function_arn                  = (known after apply)
      + function_name                 = "clash-bot-event-handler"
      + id                            = (known after apply)
      + last_modified                 = (known after apply)
      + last_processing_result        = (known after apply)
      + maximum_record_age_in_seconds = (known after apply)
      + maximum_retry_attempts        = (known after apply)
      + parallelization_factor        = (known after apply)
      + state                         = (known after apply)
      + state_transition_reason       = (known after apply)
      + uuid                          = (known after apply)
    }

  # aws_lambda_function.event_handler_lambda will be created
  + resource "aws_lambda_function" "event_handler_lambda" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + function_name                  = "clash-bot-event-handler"
      + handler                        = "handler.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:iam::816923827429:role/clash_bot_lambda_event_handler_exec_role"
      + runtime                        = "nodejs16.x"
      + s3_key                         = "event-handler-88.tar.gz"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = {
          + "Application" = "ClashBot"
          + "Environment" = "development"
        }
      + timeout                        = 3
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "CREATE_TEAM_SF_ARN"            = "arn:aws:states:us-east-1:816923827429:stateMachine:retrieve-teams-development"
              + "CREATE_TENTATIVE_QUEUE_SF_ARN" = "arn:aws:states:us-east-1:816923827429:stateMachine:retrieve-teams-development"
              + "DELETE_TEAM_SF_ARN"            = "arn:aws:states:us-east-1:816923827429:stateMachine:retrieve-teams-development"
              + "DELETE_TENTATIVE_QUEUE_SF_ARN" = "arn:aws:states:us-east-1:816923827429:stateMachine:retrieve-teams-development"
              + "UPDATE_TEAM_SF_ARN"            = "arn:aws:states:us-east-1:816923827429:stateMachine:retrieve-teams-development"
              + "UPDATE_TENTATIVE_QUEUE_SF_ARN" = "arn:aws:states:us-east-1:816923827429:stateMachine:retrieve-teams-development"
            }
        }
    }

  # aws_lambda_function.event_publisher_lambda will be created
  + resource "aws_lambda_function" "event_publisher_lambda" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + function_name                  = "clash-bot-event-publisher"
      + handler                        = "handler.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:iam::816923827429:role/clash_bot_lambda_event_publisher_exec_role"
      + runtime                        = "nodejs16.x"
      + s3_key                         = "event-publisher-88.tar.gz"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = {
          + "Application" = "ClashBot"
          + "Environment" = "development"
        }
      + timeout                        = 3
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "QUEUE_URL" = "arn:aws:sqs:us-east-1:816923827429:clash-bot-event-sqs-development.fifo"
            }
        }
    }

  # module.api_gateway.aws_apigatewayv2_api_mapping.this[0] will be created
  + resource "aws_apigatewayv2_api_mapping" "this" {
      + api_id      = "w6261upn4d"
      + domain_name = (known after apply)
      + id          = (known after apply)
      + stage       = (known after apply)
    }

  # module.api_gateway.aws_apigatewayv2_domain_name.this[0] will be created
  + resource "aws_apigatewayv2_domain_name" "this" {
      + api_mapping_selection_expression = (known after apply)
      + arn                              = (known after apply)
      + domain_name                      = "clash-bot.ninja"
      + id                               = (known after apply)
      + tags_all                         = {
          + "Application" = "ClashBot"
          + "Environment" = "development"
        }

      + domain_name_configuration {
          + certificate_arn                        = "arn:aws:acm:us-east-1:816923827429:certificate/1d277044-1781-46f9-b693-50c8ff95546a"
          + endpoint_type                          = "REGIONAL"
          + hosted_zone_id                         = (known after apply)
          + ownership_verification_certificate_arn = (known after apply)
          + security_policy                        = "TLS_1_2"
          + target_domain_name                     = (known after apply)
        }
    }

  # module.api_gateway.aws_apigatewayv2_integration.this["$default"] will be created
  + resource "aws_apigatewayv2_integration" "this" {
      + api_id                                    = "w6261upn4d"
      + connection_type                           = "INTERNET"
      + id                                        = (known after apply)
      + integration_method                        = "POST"
      + integration_response_selection_expression = (known after apply)
      + integration_type                          = "MOCK"
      + payload_format_version                    = "1.0"
      + timeout_milliseconds                      = (known after apply)
    }

  # module.api_gateway.aws_apigatewayv2_route.this["$default"] will be created
  + resource "aws_apigatewayv2_route" "this" {
      + api_id             = "w6261upn4d"
      + api_key_required   = false
      + authorization_type = "NONE"
      + id                 = (known after apply)
      + route_key          = "$default"
      + target             = (known after apply)
    }

  # module.api_gateway.aws_apigatewayv2_stage.default[0] will be created
  + resource "aws_apigatewayv2_stage" "default" {
      + api_id        = "w6261upn4d"
      + arn           = (known after apply)
      + auto_deploy   = true
      + deployment_id = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + name          = "$default"
      + tags_all      = {
          + "Application" = "ClashBot"
          + "Environment" = "development"
        }
    }

Plan: 8 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @Poss111, Action: `pull_request`*